# Почти «Майнкрафт»

## 📌 Описание

В данном задании необходимо реализовать упрощённую модель трёхмерного мира, похожего на ландшафт из игры Minecraft.

Мир представляет собой квадратное поле размером **5 × 5**, где каждая клетка содержит вертикальный столбец блоков (высоту). Максимальная высота столбца — **10 блоков**.

На основе введённых пользователем данных требуется:

* сформировать **трёхмерный массив**;
* вывести **горизонтальный срез** мира на заданном уровне.

---

## 📥 Входные данные

1. Матрица высот размером **5 × 5**
   Каждое значение — это высота столбца (от 0 до 10).

2. Уровень среза (**slice level**)
   Целое число от **0 до 9**.

---

## 📤 Выходные данные

Программа должна вывести матрицу **5 × 5**, состоящую из:

* `1` — если на данном уровне в клетке есть блок
* `0` — если блока нет

---

## 🧠 Принцип работы

1. Создаётся трёхмерный массив:

   ```
   world[5][5][10]
   ```

2. Заполнение массива:

   * Если уровень `h` меньше высоты столбца → `1`
   * Иначе → `0`

3. При выводе:

   * Берётся заданный уровень `level`
   * Для каждой клетки проверяется:

     ```
     world[i][j][level]
     ```

---

## ▶️ Пример

### Ввод:

```
5 5 5 5 5
4 4 4 4 4
3 2 2 3 3
1 1 1 1 1
0 0 0 0 0

level = 3
```

### Вывод:

```
1 1 1 1 1
1 1 1 1 1
1 0 0 1 1
0 0 0 0 0
0 0 0 0 0
```

---

## ⚙️ Требования

* Использовать **трёхмерный массив**
* Размер мира строго:

  * X: 5
  * Y: 5
  * Z: 10
* Обработка пользовательского ввода
* Проверка корректности уровня (0–9)

---

## 🚫 Возможные ошибки

* Выход за границы массива
* Неправильное заполнение 3D массива
* Использование только 2D массива (не соответствует заданию)
* Отсутствие проверки уровня

---

## 💡 Подсказка

Проверка наличия блока:

```
if (world[i][j][level])
    cout << 1;
else
    cout << 0;
```

---

## 🏁 Результат

В результате выполнения программы пользователь может "смотреть" горизонтальные слои 3D-ландшафта, задавая уровень среза.

Это задание развивает:

* пространственное мышление
* работу с многомерными массивами
* аккуратность при индексации
